In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("orders.csv")
data

   OrderID  CustomerID  Amount   OrderDate
0      101         1.0  250.50  2024-12-20
1      102         2.0  120.00  2024-12-21
2      103         3.0  320.00  2024-12-22
3      104         4.0     NaN  2024-12-23
4      105         NaN  150.75  2024-12-24

In [3]:
data.shape

(5, 4)

In [4]:
data.head()

   OrderID  CustomerID  Amount   OrderDate
0      101         1.0  250.50  2024-12-20
1      102         2.0  120.00  2024-12-21
2      103         3.0  320.00  2024-12-22
3      104         4.0     NaN  2024-12-23
4      105         NaN  150.75  2024-12-24

In [5]:
data.tail()

   OrderID  CustomerID  Amount   OrderDate
0      101         1.0  250.50  2024-12-20
1      102         2.0  120.00  2024-12-21
2      103         3.0  320.00  2024-12-22
3      104         4.0     NaN  2024-12-23
4      105         NaN  150.75  2024-12-24

In [6]:
data.head(2)

   OrderID  CustomerID  Amount   OrderDate
0      101         1.0   250.5  2024-12-20
1      102         2.0   120.0  2024-12-21

In [7]:
data.tail(4)

   OrderID  CustomerID  Amount   OrderDate
1      102         2.0  120.00  2024-12-21
2      103         3.0  320.00  2024-12-22
3      104         4.0     NaN  2024-12-23
4      105         NaN  150.75  2024-12-24

In [38]:
data.describe()

          OrderID      Amount     new_col
count    5.000000    4.000000    4.000000
mean   103.000000  210.312500  105.000000
std      1.581139   91.924646    2.581989
min    101.000000  120.000000  102.000000
25%    102.000000  143.062500  103.500000
50%    103.000000  200.625000  105.000000
75%    104.000000  267.875000  106.500000
max    105.000000  320.000000  108.000000

In [8]:
data.columns

Index(['OrderID', 'CustomerID', 'Amount', 'OrderDate'], dtype='object')

In [9]:
data['Amount'].max()

320.0

In [10]:
data['Amount'].min()

120.0

In [18]:
data['OrderDate']

0    2024-12-20
1    2024-12-21
2    2024-12-22
3    2024-12-23
4    2024-12-24
Name: OrderDate, dtype: object

In [19]:
data[['Amount', 'OrderDate']]

   Amount   OrderDate
0  250.50  2024-12-20
1  120.00  2024-12-21
2  320.00  2024-12-22
3     NaN  2024-12-23
4  150.75  2024-12-24

In [20]:
type[data['Amount']]

type[0    250.50
1    120.00
2    320.00
3       NaN
4    150.75
Name: Amount, dtype: float64]

In [21]:
data.loc()

In [11]:
data.isnull()

   OrderID  CustomerID  Amount  OrderDate
0    False       False   False      False
1    False       False   False      False
2    False       False   False      False
3    False       False    True      False
4    False        True   False      False

In [12]:
new_data = data.dropna(axis = 0)
new_data

   OrderID  CustomerID  Amount   OrderDate
0      101         1.0   250.5  2024-12-20
1      102         2.0   120.0  2024-12-21
2      103         3.0   320.0  2024-12-22

In [13]:
new_data = data.dropna(axis = 1)
new_data

   OrderID   OrderDate
0      101  2024-12-20
1      102  2024-12-21
2      103  2024-12-22
3      104  2024-12-23
4      105  2024-12-24

In [14]:
new_data = data.interpolate
new_data

<bound method NDFrame.interpolate of    OrderID  CustomerID  Amount   OrderDate
0      101         1.0  250.50  2024-12-20
1      102         2.0  120.00  2024-12-21
2      103         3.0  320.00  2024-12-22
3      104         4.0     NaN  2024-12-23
4      105         NaN  150.75  2024-12-24>

In [15]:
new_data = data.fillna(data['Amount'].mean())
new_data

   OrderID  CustomerID    Amount   OrderDate
0      101      1.0000  250.5000  2024-12-20
1      102      2.0000  120.0000  2024-12-21
2      103      3.0000  320.0000  2024-12-22
3      104      4.0000  210.3125  2024-12-23
4      105    210.3125  150.7500  2024-12-24

In [16]:
new_data=data.fillna(method='ffill')
new_data

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_416176\126269373.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data=data.fillna(method='ffill')

   OrderID  CustomerID  Amount   OrderDate
0      101         1.0  250.50  2024-12-20
1      102         2.0  120.00  2024-12-21
2      103         3.0  320.00  2024-12-22
3      104         4.0  320.00  2024-12-23
4      105         4.0  150.75  2024-12-24

In [17]:
new_data=data.fillna(method='bfill')
new_data

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_416176\1407429032.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data=data.fillna(method='bfill')

   OrderID  CustomerID  Amount   OrderDate
0      101         1.0  250.50  2024-12-20
1      102         2.0  120.00  2024-12-21
2      103         3.0  320.00  2024-12-22
3      104         4.0  150.75  2024-12-23
4      105         NaN  150.75  2024-12-24

In [24]:
data['new_col'] = data['OrderID'] + data['CustomerID']
data

   OrderID  CustomerID  Amount   OrderDate  new_col
0      101         1.0  250.50  2024-12-20    102.0
1      102         2.0  120.00  2024-12-21    104.0
2      103         3.0  320.00  2024-12-22    106.0
3      104         4.0     NaN  2024-12-23    108.0
4      105         NaN  150.75  2024-12-24      NaN

In [26]:
pd.get_dummies(data['Amount'])

   120.00  150.75  250.50  320.00
0   False   False    True   False
1    True   False   False   False
2   False   False   False    True
3   False   False   False   False
4   False    True   False   False

In [27]:
new_data = data.groupby('OrderDate')
new_data

In [28]:
new_data['Amount'].sum()

OrderDate
2024-12-20    250.50
2024-12-21    120.00
2024-12-22    320.00
2024-12-23      0.00
2024-12-24    150.75
Name: Amount, dtype: float64

In [29]:
new_data['Amount'].max()

OrderDate
2024-12-20    250.50
2024-12-21    120.00
2024-12-22    320.00
2024-12-23       NaN
2024-12-24    150.75
Name: Amount, dtype: float64

In [30]:
customers = pd.read_csv('customers.csv')
customers

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [31]:
pd.merge(data, customers, on='CustomerID', how='inner')

,OrderID,CustomerID,Amount,OrderDate,new_col,Name,Age,City
0,101,1.0,250.5,2024-12-20,102.0,Alice,25.0,New York
1,102,2.0,120.0,2024-12-21,104.0,Bob,30.0,Los Angeles
2,103,3.0,320.0,2024-12-22,106.0,Charlie,35.0,NaN
3,104,4.0,NaN,2024-12-23,108.0,David,NaN,Chicago

In [35]:
# data.set_index('CustomerID', inplace=True)
# customers.set_index('CustomerID', inplace=True)
# data.join(customers, how = 'left')

In [36]:
pd.concat([data, customers])

            OrderID  Amount   OrderDate  new_col     Name   Age         City
CustomerID
1.0           101.0  250.50  2024-12-20    102.0      NaN   NaN          NaN
2.0           102.0  120.00  2024-12-21    104.0      NaN   NaN          NaN
3.0           103.0  320.00  2024-12-22    106.0      NaN   NaN          NaN
4.0           104.0     NaN  2024-12-23    108.0      NaN   NaN          NaN
NaN           105.0  150.75  2024-12-24      NaN      NaN   NaN          NaN
1.0             NaN     NaN         NaN      NaN    Alice  25.0     New York
2.0             NaN     NaN         NaN      NaN      Bob  30.0  Los Angeles
3.0             NaN     NaN         NaN      NaN  Charlie  35.0          NaN
4.0             NaN     NaN         NaN      NaN    David   NaN      Chicago
5.0             NaN     NaN         NaN      NaN      Eve  45.0      Houston

In [37]:
data.drop_duplicates()

            OrderID  Amount   OrderDate  new_col
CustomerID
1.0             101  250.50  2024-12-20    102.0
2.0             102  120.00  2024-12-21    104.0
3.0             103  320.00  2024-12-22    106.0
4.0             104     NaN  2024-12-23    108.0
NaN             105  150.75  2024-12-24      NaN

In [40]:
data['OrderDate'].value_counts()

OrderDate
2024-12-20    1
2024-12-21    1
2024-12-22    1
2024-12-23    1
2024-12-24    1
Name: count, dtype: int64

In [41]:
new_data = (data['Amount'] - data['Amount'].mean()) / data['Amount'].std()
new_data

CustomerID
1.0    0.437179
2.0   -0.982462
3.0    1.193233
4.0         NaN
NaN   -0.647949
Name: Amount, dtype: float64

In [42]:
new_data = data['Amount'].apply(np.log1p)
new_data

CustomerID
1.0    5.527443
2.0    4.795791
3.0    5.771441
4.0         NaN
NaN    5.022234
Name: Amount, dtype: float64

In [46]:
data['Date'] = pd.to_datetime(data['OrderDate'])
data

            OrderID  Amount  OrderDate  new_col       Date
CustomerID
1.0             101  250.50 2024-12-20    102.0 2024-12-20
2.0             102  120.00 2024-12-21    104.0 2024-12-21
3.0             103  320.00 2024-12-22    106.0 2024-12-22
4.0             104     NaN 2024-12-23    108.0 2024-12-23
NaN             105  150.75 2024-12-24      NaN 2024-12-24

In [47]:
data.set_index('OrderDate')

            OrderID  Amount  new_col       Date
OrderDate
2024-12-20      101  250.50    102.0 2024-12-20
2024-12-21      102  120.00    104.0 2024-12-21
2024-12-22      103  320.00    106.0 2024-12-22
2024-12-23      104     NaN    108.0 2024-12-23
2024-12-24      105  150.75      NaN 2024-12-24

In [50]:
# data.resample('OrderDate').sum()

In [43]:
data.to_csv('modified_orders.csv')